Revit 2025 API
Document.SetDefaultFamilyTypeId Method
 Sets the default family type id for the given family category.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public void SetDefaultFamilyTypeId(
	ElementId familyCategoryId,
	ElementId familyTypeId
)
Public Sub SetDefaultFamilyTypeId (
	familyCategoryId As ElementId,
	familyTypeId As ElementId
)
public:
void SetDefaultFamilyTypeId(
	ElementId^ familyCategoryId,
	ElementId^ familyTypeId
)
member SetDefaultFamilyTypeId :
        familyCategoryId : ElementId *
        familyTypeId : ElementId -> unit
Parameters
familyCategoryId ElementId
 The family category id.
familyTypeId ElementId
 The default family type id.
Exceptions
Exception | Condition
ArgumentException |  The family type id familyTypeId is invalid for the give family category familyCategoryId.
ArgumentNullException |  A non-optional argument was null
Example
private void SetDefaultTypeFromDoor(Document document, FamilyInstance door)
{
    ElementId doorCategoryId = new ElementId(BuiltInCategory.OST_Doors);
    // It is necessary to test the type suitability to be a default family type, for not every type can be set as default.
    // Trying to set a non-qualifying default type will cause an exception
    if (door.Symbol.IsValidDefaultFamilyType(doorCategoryId))
    {
        document.SetDefaultFamilyTypeId(doorCategoryId, door.Symbol.Id);
    }
}
Private Sub SetDefaultTypeFromDoor(document As Document, door As FamilyInstance)
   Dim doorCategoryId As New ElementId(BuiltInCategory.OST_Doors)
   ' It is necessary to test the type suitability to be a default family type, for not every type can be set as default.
   ' Trying to set a non-qualifying default type will cause an exception
   If door.Symbol.IsValidDefaultFamilyType(doorCategoryId) Then
      document.SetDefaultFamilyTypeId(doorCategoryId, door.Symbol.Id)
   End If
End Sub
No code example is currently available or this language may not be supported.
No code example is currently available or this language may not be supported.
See Also
Reference
Document Class
Autodesk.Revit.DB Namespace